Model: "vgg19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_6 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
resizing_1 (Resizing)        (None, 32, 32, 1)         0         
_________________________________________________________________
vgg19 (Functional)           (None, 10)                38946762  
=================================================================
Total params: 38,946,762
Trainable params: 38,946,762
Non-trainable params: 0
_________________________________________________________________