Model: "vgg16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
resizing (Resizing)          (None, 32, 32, 1)         0         
_________________________________________________________________
vgg16 (Functional)           (None, 10)                33637066  
=================================================================
Total params: 33,637,066
Trainable params: 33,637,066
Non-trainable params: 0
_________________________________________________________________